""" В некоторой школе решили набрать три новых
математических класса и оборудовать кабинеты для
них новыми партами. За каждой партой может сидеть
два учащихся. Известно количество учащихся в
каждом из трех классов. Выведите наименьшее
число парт, которое нужно приобрести для них
 """

""" a = 20
b = 21
c = 22

res = a + b + c
if res % 2 != 0: 
    res += 1
res /= 2
print (int (res))

 """

""" n = 1999

if (n % 4 == 0  and n % 100 !=0) or n % 400 ==0:
    print ("Yes")
else:
    print ("No") """

2