# Напишите программу, которая принимает на вход
# строку, и отслеживает, сколько раз каждый символ
# уже встречался. Количество повторов добавляется к
# символам с помощью постфикса формата _n.
# Input: a a a b c a a d c d d
# Output: a a_1 a_2 b c a_3 a_4 d c_1 d_1 d_2
# Для решения данной задачи используйте функцию
# .split()
import os
os.system("cls")


# Задача №25. Общее обсуждение
# Напишите программу, которая принимает на вход
# строку, и отслеживает, сколько раз каждый символ
# уже встречался. Количество повторов добавляется к
# символам с помощью постфикса формата _n.
# Input: a a a b c a a d c d d
# Output: a a_1 a_2 b c a_3 a_4 d c_1 d_1 d_2
# Для решения данной задачи используйте функцию
# .split()

sp = "a a a b c a a d c d d"
new_list = sp.split()
# print(new_list)
new_ar = {}
result = ""
for i in new_list:
    if i not in new_ar:
        new_ar[i] = 0
        result +=f"{i} "
    else:
        new_ar[i] += 1
        result +=f"{i}_{new_ar[i]} "
print(result)